---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersDataFolderPath
source: html/3ff50826-aae6-0b19-8057-15af6a88cd41.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersDataFolderPath Property

Path to data folder for the current user.

## Syntax (C#)
```csharp
public string CurrentUsersDataFolderPath { get; }
```

## Remarks
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]